In [10]:
import numpy as np

In [11]:
import pandas as pd

In [12]:
grades = {"Atıl" :50 , "James" :60 , " Laras" :70}

In [13]:
pd.Series(grades)

Atıl      50
James     60
 Laras    70
dtype: int64

In [14]:
names = ["Atıl" , "James" , "Laras"]
grades= [50,60,70]

In [15]:
pd.Series(grades)

0    50
1    60
2    70
dtype: int64

In [16]:
pd.Series(grades , names )

Atıl     50
James    60
Laras    70
dtype: int64

In [17]:
numpy_array = np.array([50,60,70,80])

In [18]:
pd.Series(numpy_array)

0    50
1    60
2    70
3    80
dtype: int32

In [19]:
#arithmetic

In [21]:
 contest_result = pd.Series(data = [10,5,100] , index = ["Atıl","James", "Lars"])

In [22]:
contest_result2 = pd.Series(data = [20,30,50] , index = ["Atıl","James", "Lars"])

In [23]:
 contest_result

Atıl      10
James      5
Lars     100
dtype: int64

In [24]:
 contest_result2

Atıl     20
James    30
Lars     50
dtype: int64

In [26]:
 contest_result["Atıl"]

10

In [27]:
final_result =  contest_result +  contest_result2

In [28]:
final_result

Atıl      30
James     35
Lars     150
dtype: int64

In [29]:
difference_series = pd.Series([20,30,40,50] , ["a" , "b" , "c","d"])

In [30]:
difference_series

a    20
b    30
c    40
d    50
dtype: int64

In [31]:
difference_series2 = pd.Series([10,5,3,1],["a","c","f","g"])

In [32]:
difference_series2

a    10
c     5
f     3
g     1
dtype: int64

In [33]:
difference_series + difference_series2

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

In [34]:
# DATAFRAME

In [54]:
data = np.random.randn(4,3)

In [55]:
data

array([[ 1.19867468, -0.10017828, -0.15452179],
       [-1.23120575, -0.27040348, -0.74266323],
       [-0.26726451,  1.18305618,  1.07282409],
       [ 0.34735553, -0.02406598, -1.53872683]])

In [56]:
data_frame =pd.DataFrame(data)

In [57]:
data_frame

          0         1         2
0  1.198675 -0.100178 -0.154522
1 -1.231206 -0.270403 -0.742663
2 -0.267265  1.183056  1.072824
3  0.347356 -0.024066 -1.538727

In [58]:
type(data_frame)

pandas.core.frame.DataFrame

In [40]:
data_frame[0]

0   -0.825785
1   -0.826025
2   -0.018609
3    1.699578
Name: 0, dtype: float64

In [47]:
type(data_frame[0])

pandas.core.series.Series

In [49]:
new_df = pd.DataFrame(data , index = ["Atil" , "Zeynep" , "Atlas" , "Mehmet"] , columns = ["Salary" , "Age" , "Seniority" ])

In [50]:
new_df

          Salary       Age  Seniority
Atil   -0.825785 -0.821741   1.702729
Zeynep -0.826025 -0.609280  -0.169197
Atlas  -0.018609  0.334303   0.017642
Mehmet  1.699578  0.069536   1.681590

In [59]:
new_df["Age"]

Atil     -0.821741
Zeynep   -0.609280
Atlas     0.334303
Mehmet    0.069536
Name: Age, dtype: float64

In [60]:
new_df[["Age" , "Salary"]]

             Age    Salary
Atil   -0.821741 -0.825785
Zeynep -0.609280 -0.826025
Atlas   0.334303 -0.018609
Mehmet  0.069536  1.699578

In [61]:
new_df.loc["Atil"]

Salary      -0.825785
Age         -0.821741
Seniority    1.702729
Name: Atil, dtype: float64

In [63]:
new_df.iloc[0]

Salary      -0.825785
Age         -0.821741
Seniority    1.702729
Name: Atil, dtype: float64

In [65]:
new_df["Extra"] = 10

In [66]:
new_df

          Salary       Age  Seniority  Extra
Atil   -0.825785 -0.821741   1.702729     10
Zeynep -0.826025 -0.609280  -0.169197     10
Atlas  -0.018609  0.334303   0.017642     10
Mehmet  1.699578  0.069536   1.681590     10

In [67]:
new_df.drop("Extra", axis = 1)

          Salary       Age  Seniority
Atil   -0.825785 -0.821741   1.702729
Zeynep -0.826025 -0.609280  -0.169197
Atlas  -0.018609  0.334303   0.017642
Mehmet  1.699578  0.069536   1.681590

In [68]:
new_df["Mehmet"] = 10

In [69]:
new_df

          Salary       Age  Seniority  Extra  Mehmet
Atil   -0.825785 -0.821741   1.702729     10      10
Zeynep -0.826025 -0.609280  -0.169197     10      10
Atlas  -0.018609  0.334303   0.017642     10      10
Mehmet  1.699578  0.069536   1.681590     10      10

In [70]:
new_df.drop("Mehmet")

          Salary       Age  Seniority  Extra  Mehmet
Atil   -0.825785 -0.821741   1.702729     10      10
Zeynep -0.826025 -0.609280  -0.169197     10      10
Atlas  -0.018609  0.334303   0.017642     10      10

In [71]:
new_df.drop("Mehmet" , axis=1 , inplace = True)

In [72]:
new_df

          Salary       Age  Seniority  Extra
Atil   -0.825785 -0.821741   1.702729     10
Zeynep -0.826025 -0.609280  -0.169197     10
Atlas  -0.018609  0.334303   0.017642     10
Mehmet  1.699578  0.069536   1.681590     10

In [73]:
new_df.drop("Mehmet" , axis =0)

          Salary       Age  Seniority  Extra
Atil   -0.825785 -0.821741   1.702729     10
Zeynep -0.826025 -0.609280  -0.169197     10
Atlas  -0.018609  0.334303   0.017642     10

In [75]:
new_df.loc["Atlas","Salary"] = 100

In [76]:
new_df

            Salary       Age  Seniority  Extra
Atil     -0.825785 -0.821741   1.702729     10
Zeynep   -0.826025 -0.609280  -0.169197     10
Atlas   100.000000  0.334303   0.017642     10
Mehmet    1.699578  0.069536   1.681590     10

In [77]:
new_df >0

        Salary    Age  Seniority  Extra
Atil     False  False       True   True
Zeynep   False  False      False   True
Atlas     True   True       True   True
Mehmet    True   True       True   True

In [78]:
new_df[new_df > 0 ]

            Salary       Age  Seniority  Extra
Atil           NaN       NaN   1.702729     10
Zeynep         NaN       NaN        NaN     10
Atlas   100.000000  0.334303   0.017642     10
Mehmet    1.699578  0.069536   1.681590     10

In [81]:
new_df[new_df["Salary"] > 1 ]

            Salary       Age  Seniority  Extra
Atlas   100.000000  0.334303   0.017642     10
Mehmet    1.699578  0.069536   1.681590     10

In [82]:
new_df.reset_index()

    index      Salary       Age  Seniority  Extra
0    Atil   -0.825785 -0.821741   1.702729     10
1  Zeynep   -0.826025 -0.609280  -0.169197     10
2   Atlas  100.000000  0.334303   0.017642     10
3  Mehmet    1.699578  0.069536   1.681590     10

In [83]:
new_df

            Salary       Age  Seniority  Extra
Atil     -0.825785 -0.821741   1.702729     10
Zeynep   -0.826025 -0.609280  -0.169197     10
Atlas   100.000000  0.334303   0.017642     10
Mehmet    1.699578  0.069536   1.681590     10

In [86]:
reset_frame = new_df.reset_index()

In [92]:
reset_frame.loc[0]

index            Atil
Salary      -0.825785
Age         -0.821741
Seniority    1.702729
Extra              10
Name: 0, dtype: object

In [99]:
new_indices = ["Ati" ,"zey" , "meh" ,"atl"]
new_df["newIndex"] = new_indices

In [100]:
new_df

            Salary       Age  Seniority  Extra neIndex newIndex
Atil     -0.825785 -0.821741   1.702729     10     Ati      Ati
Zeynep   -0.826025 -0.609280  -0.169197     10     zey      zey
Atlas   100.000000  0.334303   0.017642     10     meh      meh
Mehmet    1.699578  0.069536   1.681590     10     atl      atl

In [105]:
new_df.drop("neIndex", axis=1, inplace=True)

In [106]:
new_df

            Salary       Age  Seniority  Extra newIndex
Atil     -0.825785 -0.821741   1.702729     10      Ati
Zeynep   -0.826025 -0.609280  -0.169197     10      zey
Atlas   100.000000  0.334303   0.017642     10      meh
Mehmet    1.699578  0.069536   1.681590     10      atl

In [107]:
new_df.set_index("newIndex" , inplace =True)

In [108]:
new_df

              Salary       Age  Seniority  Extra
newIndex
Ati        -0.825785 -0.821741   1.702729     10
zey        -0.826025 -0.609280  -0.169197     10
meh       100.000000  0.334303   0.017642     10
atl         1.699578  0.069536   1.681590     10

In [109]:
new_df.loc["Ati"]

Salary       -0.825785
Age          -0.821741
Seniority     1.702729
Extra        10.000000
Name: Ati, dtype: float64

In [110]:
  # multi index

In [111]:
first_index = ["Simpson" ,"Simpson" ,"Simpson" ,"Simpson" ,"Sout Park" ,"South Park" ]

In [112]:
inner_index = ["Homer", "Bart" , "Marge", "Cartman"]

In [113]:
zipped_list = list(zip(first_index , inner_index))

In [114]:
 zipped_list

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('Simpson', 'Cartman')]

In [115]:
 zipped_list = pd.MultiIndex.from_tuples(zipped_list)

In [116]:
 zipped_list

MultiIndex([('Simpson',   'Homer'),
            ('Simpson',    'Bart'),
            ('Simpson',   'Marge'),
            ('Simpson', 'Cartman')],
           )